<!DOCTYPE html>
<html lang="zxx">

<head>
    <meta charset="utf-8" />
    <title>Grupo de Estudio</title>
    <meta content="width=device-width, initial-scale=1.0" name="viewport" />
    <meta content="" name="description" />
    <meta content="" name="keywords" />
    <meta content="" name="author" />
    <!--[if lt IE 9]>
            <script src="js/html5shiv.js"></script>
        <![endif]-->
    <!-- CSS Files
    ================================================== -->
    <link href="css/bootstrap.min.css" rel="stylesheet" type="text/css" />
    <link href="css/jpreloader.css" rel="stylesheet" type="text/css">
    <link href="css/animate.css" rel="stylesheet" type="text/css" />
    <link href="css/owl.carousel.css" rel="stylesheet" type="text/css" />
    <link href="css/owl.theme.css" rel="stylesheet" type="text/css" />
    <link href="css/owl.transitions.css" rel="stylesheet" type="text/css" />
    <link href="css/magnific-popup.css" rel="stylesheet" type="text/css" />
    <link href="css/jquery.countdown.css" rel="stylesheet" type="text/css" />
    <link href="css/style.css" rel="stylesheet" type="text/css" />
    <!-- color scheme -->
    <link id="colors" href="css/colors/scheme-01.css" rel="stylesheet" type="text/css" />
    <link href="css/coloring.css" rel="stylesheet" type="text/css" />
</head>

<body>
    <div id="wrapper">
        <a href="javascript:history.back()" id="btn-exit" class="clicked">
            <span class="line-1"></span>
            <span class="line-2"></span>
        </a>
        <div class="transition"></div>        
        
        <!-- content begin -->
        <div class="no-bottom no-top dark">
            <div id="top"></div>
            <!-- section begin -->
            <!-- section begin -->
            <section id="section-main" class="dark">
                <div class="container">
                    <div class="row">
                        <div class="col-lg-12">
                            <h2 class="title date">Grupo de Estudio Scikit-learn aplicado a modelos predictivos<span>12 Septiembre 2021</span></h2>
                            <div class="title-underline"></div>
                        </div>
                    </div>

                    <div class="row">
                        <div class="col-md-8 offset-md-2">
                            <div class="blog-read">

                                <center><img alt="" src="images/news/grupo_estudio.jpeg" width="350" height="350" /></center> <br></br>

                                <div class="post-text">
                                    <p>El grupo de estudio fue dirigido a estudiantes, egresados y profesionales a nivel latinoam&eacute;rica, en sesiones realizadas v&iacute;a Google Meet. Se capacit&oacute; a los participantes sobre una introducci&oacute;n a Python, temas relacionados a Machine Learning, Natural Language Processing (NLP) y Deep Learning.</p>
                                    <p>Incluyendo el siguiente temario:<br></br>
                                        - <b>Sesi&oacute;n 1 - Introducci&oacute;n a K-means:</b> Conceptos b&aacute;sicos cl&uacute;ster, clustering, funcionamiento del k-means, caso pr&aacute;ctico Clusterizaci&oacute;n de personas usando Google Colab.</br>
                                        - <b>Sesi&oacute;n 2 - PreProcesamiento de Datos:</b> Explicaci&oacute;n sobre qu&eacute; son los outliers, vac&iacute;os, feature engineering, encodear, normalizar, estandarizar, caso pr&aacute;ctico PreProcesamiento del dataset Titanic - Machine Learning from disaster - Kaggle.<br>
                                        - <b>Sesi&oacute;n 3 - Modelos de clasificaci&oacute;n:</b> Learning rate, overfitting y underfitting, early stopping, tipos de modelos predictivos, regresi&oacute;n log&iacute;stica, &aacute;rboles de decisi&oacute;n, random forest, matriz de confusi&oacute;n y sus m&eacute;tricas, casos pr&aacute;ctico algoritmo random forest y regresi&oacute;n log&iacute;stica en el caso Titanic - Machine Learning from disaster.</br>
                                        - <b>Sesi&oacute;n 4 - Introducci&oacute;n a las redes neuronales:</b> Comprensi&oacute;n sobre neuronas artificiales, definici&oacute;n conceptos machine learning y deep learning, explicaci&oacute;n sobre que es input, bias, weights y output, funciones de activaci&oacute;n, funciones de p&eacute;rdida, optimizadores, clasificaci&oacute;n binaria, 6 laboratorios a trav&eacute;s del curso Intro to deep learning de Kaggle y caso pr&aacute;ctico creaci&oacute;n de una red neuronal perceptr&oacute;n multicapa en el caso Titanic - Machine Learning from disaster.<br>
                                        - <b>Sesi&oacute;n 5 - Primer repaso:</b> Repaso  sobre las redes neuronales artificiales, funcionamiento de la red neuronal perceptr&oacute;n multicapa, back propagation, vanishing and exploding gradient, batch normalization, dropout, t&eacute;cnicas de sobremuestreo y submuestreo, caso pr&aacute;ctico Credit Card Customers - Kaggle.</br>
                                        - <b>Sesi&oacute;n 6 - NLP:</b> Introducci&oacute;n al NLP, clasificaci&oacute;n de texto, word embeddings, lematizaci&oacute;n y radicalizaci&oacute;n, bag of words, TF-IDF, Word to vec, caso pr&aacute;ctico introducci&oacute;n al procesamiento del lenguaje natural.<br>
                                        - <b>Sesi&oacute;n repaso 2:</b> Visualizaci&oacute;n de datos con python, inputaci&oacute;n de datos, tratamiento de outliers, gr&aacute;ficas avanzadas con seaborn.<br></br>

                                    </p>
                                
                                    <p> Se evalu&oacute; las sesiones mediante cuestionarios de respuestas r&aacute;pida v&iacute;a kahoot y dejando tareas en c&oacute;digo v&iacute;a Google Colaboratory. Adicionalmente al finalizar el grupo de estudio, los integrantes realizaron una presentaci&oacute;n de sus proyectos donde pudieron utilizar los conocimientos aprendidos al crear algoritmos predictivos utilizando machine learning. </p>
                                    
                                    <p>Se emitieron constancias de participaci&oacute;n a los que culminaron el grupo de estudio con una nota min&iacute;ma de 14 siendo evaluados en kahoots y ejercicios v&iacute;a google colab, y certificados de participaci&oacute;n a los que presentaron sus proyectos finales.</p>

                                    <blockquote>Link del Repositorio: <a href="https://github.com/SergioGerman412/Grupo-de-Estudio-Scikit-learn-aplicado-a-modelos-predictivos.git"  target="_blank"> <h4>https://github.com/SergioGerman412/Grupo-de-Estudio-Scikit-learn-aplicado-a-modelos-predictivos.git</h4></blockquote>


                                </div>

                            </div>

                        </div>
                        
                    </div>
                </div>
            </section>
        </div>
        <!-- content close -->
    </div>
    
    <!-- Javascript Files
    ================================================== -->
    <script src="js/jquery.min.js"></script>
    <script src="js/jpreLoader.min.js"></script>
    <script src="js/bootstrap.min.js"></script>
    <script src="js/wow.min.js"></script>
    <script src="js/jquery.isotope.min.js"></script>
    <script src="js/easing.js"></script>
    <script src="js/owl.carousel.js"></script>
    <script src="js/validation.js"></script>
    <script src="js/jquery.magnific-popup.min.js"></script>
    <script src="js/enquire.min.js"></script>
    <script src="js/jquery.stellar.min.js"></script>
    <script src="js/jquery.plugin.js"></script>
    <script src="js/typed.js"></script>
    <script src="js/typed-custom.js"></script>
    <script src="js/designesia.js"></script>
    
</body>

</html>